{
    "monografia": [
        {
            "id": 1,
            "title": "Introdução",
            "content": " Desafios no tratamento de doenças crônicas Diabetes Mellitus Tipo 2 (DM2) e mudanças de hábitos             Incompatibilidade entre a pouca atenção dos profissionais de saúde e a natureza do tratamento            Explicações:            O tratamento de doenças crônicas apresenta desafios devido à necessidade de acompanhamento prolongado e mudanças significativas nos hábitos de vida dos pacientes. Além disso, a sobrecarga dos profissionais de saúde pode dificultar o atendimento adequado e individualizado, especialmente em tempos de pandemia.            A Diabetes Mellitus Tipo 2 (DM2) é uma doença crônica que exige mudanças de hábitos, como dieta e atividade física. No entanto, essas mudanças podem ser desafiadoras para alguns pacientes, uma vez que a doença muitas vezes é causada por uma rotina alimentar desregrada e apresenta taxas elevadas de glicemia.                        A incompatibilidade entre a pouca atenção que os profissionais de saúde podem dedicar a cada paciente e a natureza do tratamento pode dificultar a adesão dos pacientes ao tratamento da DM2 e outras doenças crônicas. Algumas mudanças de hábitos exigem esforço hercúleo por parte dos pacientes, o que pode desencorajá-los e afetar negativamente sua saúde a longo prazo.                                                Motivação                        Motivação            Desenvolvimento de um aplicativo mobile para mudança de comportamento em pacientes            Acompanhamento em tempo real dos dados inseridos pelos clientes            Viabilidade do desenvolvimento do aplicativo no C3 (Centro de Ciências Computacionais)            Explicação:                        A enfermeira Letiane de Oliveira Rubira participou do programa de Residência Integrada Multiprofissional Hospitalar com Ênfase na Atenção a Saúde Cardio-Metabólica do Adulto (RIMHAS) e identificou uma demanda por uma ferramenta que pudesse persuadir os pacientes a mudar seu comportamento.                        Como resultado, Letiane incluiu no seu projeto de residência a proposta de desenvolvimento de um aplicativo mobile que pudesse atuar como essa ferramenta de persuasão. O objetivo é que o aplicativo ajude os pacientes a adotarem hábitos mais saudáveis e a mudar seu comportamento em relação à saúde.                        O aplicativo será capaz de acompanhar em tempo real os dados inseridos pelos clientes, permitindo que eles possam monitorar seu próprio progresso e fazer ajustes em sua rotina de acordo com as necessidades.                        O desenvolvimento do aplicativo será realizado no C3 (Centro de Ciências Computacionais), que é um local viável e adequado para a implementação desse projeto.                                    Objetivo            Proposta de abordagem multidisciplinar para enfrentar os desafios da mudança comportamental e autocuidado em pacientes de DM2.            Necessidade de um processo completo de projeto e desenvolvimento de software.            Levantar e analisar a viabilidade dos requisitos.            Descobrir e utilizar as ferramentas adequadas para cumprir os requisitos.            Arquitetar e documentar o software a ser desenvolvido.            Planejar um cronograma de desenvolvimento e entrega.            Ajustar o projeto conforme feedback da proponente e dos usuários finais, os pacientes.            ",
            "isCollapsed": true,
            "link": "https://docs.google.com/document/d/1xlD7D3LS0gCsMdNG2ClHC7eDaEvv_a1pesHOUouaXPg/edit?usp=sharing"
        },
        {
            "id": 2,
            "title": "Fundamentação",
            "content": "O parágrafo fala sobre a crescente sofisticação de aplicativos mobile para cumprir tarefas simples da rotina e a dependência cada vez maior desses dispositivos. É apresentada a proposta de soluções mHealth para auxiliar no tratamento de doenças crônicas, que exigem mudanças na rotina do paciente, e são alvo de estudos para quantificar seus benefícios na qualidade de vida do paciente.            Principais pontos:                        Dispositivos móveis estão cada vez mais presentes na rotina das pessoas e seus aplicativos se sofisticam para cumprir tarefas simples do dia a dia.            Soluções mHealth têm sido apresentadas como auxiliares no tratamento de doenças crônicas que exigem mudanças na rotina do paciente.            Os benefícios dessas soluções na qualidade de vida do paciente estão sendo estudados.                                    Design interfaces                        O design de interfaces é uma área essencial para proporcionar uma boa experiência ao usuário em aplicações digitais. É importante seguir diretrizes que visam tornar a navegação mais simples e menos frustrante, levando em consideração a eficiência no uso da área da tela, a priorização do conteúdo e da funcionalidade, e a contextualização da informação de acordo com as limitações do meio de comunicação.                        Algumas das características sensoriais presentes em objetos e ambientes do mundo físico não estão presentes no ambiente digital, o que torna a explicitação de pistas importante para ajudar o usuário na locomoção e na interação com a interface. Uma boa interface deve possibilitar que o usuário saiba onde está, encontre o caminho para onde quer ir, forme um mapa mental, e identifique quando chegou ao seu destino.                        Para alcançar esses objetivos, é importante seguir algumas regras no design de interfaces, tais como:             evitar deixar o usuário em um beco sem saída;             manter o acesso à informação o mais direto possível;             priorizar a simplicidade e consistência;             fornecer feedback e diálogo com os usuários;             levar em consideração a largura de banda e a interação com a interface;             compreender o impacto da variedade de tamanhos e resoluções nas diferentes plataformas onde a aplicação será utilizada.                        Proporcionar intuitividade na utilização significa garantir que a interface seja previsível em diferentes dispositivos, e oferecer acessibilidade significa considerar as peculiaridades de cada usuário desde o início do projeto. Utilizar-se de componentes-padrão na construção da interface pode garantir uma interpretação correta em diferentes dispositivos e dar suporte às tecnologias assistivas, promovendo a acessibilidade e a inclusão.                        Modelo Comportamental Fogg                        O FBM (Modelo Comportamental de Fogg) é um modelo que descreve três elementos fundamentais que influenciam a tomada de decisão e o comportamento humano: motivação, habilidade e triggers.                        O modelo foi criado pelo pesquisador B.J. Fogg, da Universidade de Stanford, e tem sido amplamente utilizado em várias áreas, como marketing, psicologia e design de experiência do usuário.                        De acordo com o modelo FBM, a motivação é o fator mais importante na tomada de decisão. Ela se divide em três tipos: motivação pessoal (intrínseca ou extrínseca), motivação social (reputação, pertencimento, etc.) e motivação funcional (eficácia, eficiência, etc.). Em outras palavras, a motivação se refere ao desejo ou necessidade que uma pessoa tem de realizar uma determinada ação.                        A capacidade, por sua vez, se refere à habilidade ou recursos que uma pessoa possui para realizar a ação desejada. Ela se divide em duas categorias: capacidade física (habilidades motoras, por exemplo) e capacidade mental (habilidades cognitivas, como memória e atenção).                                    Interface de programação da aplicação                        A Interface de Programação de Aplicação (API) é uma parte essencial dos sistemas de comunicação entre humanos e máquinas na era da tecnologia computacional e da internet. Assim como os idiomas humanos permitem a troca de informações entre indivíduos, as APIs permitem que os sistemas se comuniquem e se integrem. As APIs web são interfaces baseadas na estrutura da internet e usam a arquitetura REST (Representational State Transfer) como padrão dominante.                        A arquitetura REST possui algumas características principais. Primeiro, a identificação do recurso a ser transferido é especificada na requisição. Além disso, há independência entre os dados e sua representação, o que permite flexibilidade na forma como os dados são transmitidos. Cada requisição é autossuficiente e realiza uma função específica. A API também fornece uma maneira de obter identificadores para outras requisições que podem ser feitas ao servidor. Por fim, a API REST suporta os verbos do protocolo HTTP, como GET, POST, PUT e DELETE.                        No contexto deste trabalho, será desenvolvido um servidor back-end seguindo os padrões da arquitetura API REST, com o objetivo de atender a essas características mencionadas.",
            "isCollapsed": true,
            "link": "https://docs.google.com/document/d/1xlD7D3LS0gCsMdNG2ClHC7eDaEvv_a1pesHOUouaXPg/edit?usp=sharing"
        },
        {
            "id": 3,
            "title": "Metodologia",
            "content": "Escolhas iniciais do projeto: O modelo incremental foi escolhido para o desenvolvimento do sistema, visando a entrega ágil de um Produto Mínimo Viável (MVP). A técnica de prototipação foi utilizada para esclarecer requisitos e desobstruir dúvidas.            Modelo incremental de desenvolvimento: Consiste em iterar constantemente sobre o ciclo de vida do software para aprimorar gradualmente o sistema. O trabalho aborda a parte inicial do projeto, que é o MVP.                        Levantamento de requisitos: Com base em Rubira (2021), foram identificadas funcionalidades do sistema e elaborado um diagrama de caso de uso. Após ajustes em reunião com a proponente, o diagrama foi configurado.                        Tipos de usuários: O sistema contempla quatro tipos de usuários com funcionalidades específicas. O Super-Usuário tem acesso pleno e é responsável pela manutenção técnica. O Profissional de Saúde Administrador registra pacientes e outros profissionais, enquanto o Profissional de Saúde Comum alimenta o sistema com registros de pacientes e consultas. O Paciente utiliza o aplicativo móvel para registrar atividades diárias.                        Requisitos gerais do sistema servidor: O sistema deve fornecer acesso via tela web de administração para os super-usuários, permitindo a manutenção do sistema e seus registros. Também deve disponibilizar uma tela web para os profissionais de saúde, filtrando as funcionalidades de acordo com o usuário. Além disso, deve oferecer uma API para comunicação com o aplicativo móvel, permitindo o registro e administração de atividades, bem como a visualização de profissionais de saúde, pacientes e consultas.                                    Projeto:                         O uso da tecnologia persuasiva é fundamental no sistema, e por isso foi necessário iniciar o projeto com uma concepção conjunta da estrutura do servidor e da interface do aplicativo mobile. Isso garante a consistência no fluxo de informações e possibilita a implementação do FBM (Fator Behaviorista Manipulativo) ao longo do processo.                                    Interface Mobile                        Ferramenta de design e concepção da interface: Foi utilizado o Figma, uma ferramenta de design de interfaces, para esboçar um primeiro conceito de interface para o aplicativo mobile do sistema. A interface definiu um estilo geral, nome e uma estrutura que atendesse aos requisitos mínimos definidos.                        Estrutura da interface do aplicativo: A Figura 8 apresenta a estrutura central do aplicativo, que faz parte do MVP do sistema. A interface é projetada com base nos fundamentos de design de interfaces, buscando simplicidade, consistência e intuitividade. Existem cinco seções principais no aplicativo, cada uma representando uma funcionalidade específica, como autenticação de usuário, administração de atividades, visualização de consultas, administração de lembretes, visualização de profissionais de saúde e edição de configurações.                        Ícones em forma de estrelas: Na tela Detalhe de Consulta (Figura 9), são utilizados ícones em forma de estrelas que têm uma dupla utilidade. Primeiro, eles representam a avaliação das atividades realizadas por um paciente, feita por um profissional de saúde, utilizando uma escala de 1 a 5. Essa avaliação fornece informações sobre a qualidade das atividades. Segundo, essas informações servem como base para a implementação do FBM, fornecendo medidas confiáveis e quantitativas que indicam quais atividades o usuário teria maior motivação em melhorar.                        Requisições da API: Com base na interface proposta, a API disponível para comunicação entre o aplicativo e o servidor deve ser capaz de lidar com as seguintes requisições: autenticar dados de login, retornar dados de uma ou várias atividades registradas no sistema pelo paciente, retornar dados de uma ou várias consultas registradas no sistema pelo paciente, retornar dados de um ou vários profissionais de saúde registrados no sistema que atendem o paciente, e registrar uma atividade no sistema, atribuindo-a implicitamente ao paciente usuário do aplicativo            ",
            "isCollapsed": true,
            "link": "https://docs.google.com/document/d/1xlD7D3LS0gCsMdNG2ClHC7eDaEvv_a1pesHOUouaXPg/edit?usp=sharing"
        },
        {
            "id": 4,
            "title": "Estrutura do servidor",
            "content": "Projeto do servidor: Com base no diagrama de caso de uso e na interface previamente apresentados, foi projetado o servidor do sistema. A estrutura do servidor foi concebida para suportar as funcionalidades previstas no sistema.            Diagrama entidade relacionamento: O diagrama de entidade relacionamento (Figura 10) apresenta a arquitetura do banco de dados. Ele abstrai os detalhes do framework Django, que foi utilizado para desenvolver o sistema.                        Metadados das tabelas: Todas as tabelas adicionais ao framework base possuem colunas de metadados que auxiliam na identificação dos registros. Esses metadados incluem data e hora de criação, data e hora da última edição, slug único (composição de acordo com a tabela) e flag de status. A presença desses metadados permite o uso da funcionalidade de soft-delete, onde registros deletados são apenas escondidos dos usuários, mas ainda permanecem na base de dados e podem ser recuperados facilmente, se necessário, por um Super-Usuário.                        Tabelas HealthProfile e PatientProfile: Essas tabelas são perfis de usuário. Além dos metadados, elas possuem três colunas adicionais: name (nome do usuário), cpf (CPF do usuário) e user (chave estrangeira para a tabela User do framework Django). Cada perfil possui também uma chave estrangeira para uma terceira tabela que permite a relação de muitos para muitos entre os perfis, ou seja, cada profissional de saúde pode assistir a vários pacientes e cada paciente pode ser assistido por vários profissionais de saúde simultaneamente.                        Tabela HealthProfile: Essa tabela é responsável pelos dados dos profissionais de saúde que utilizam o sistema. Além dos metadados, ela possui as seguintes colunas adicionais: admin (booleano que indica se o profissional de saúde é um administrador do sistema), specialty (texto que indica a especialidade do profissional de saúde, com valores pré-definidos), documentnumber (número do documento do profissional de saúde) e documenttype (chave estrangeira para a tabela Document que indica o tipo de documento, permitindo a adição de novos tipos de documentos pelos profissionais de saúde administradores).                        Tabela Activity: Essa tabela armazena os dados das atividades realizadas pelos pacientes. Ela possui vários campos para descrever esses registros, como paciente, data, turno, tipo de atividade, descrição, valor (que varia dependendo do tipo de atividade) e imagem (para atividades do tipo refeição). Alguns campos são opcionais e podem ter valor nulo no banco de dados.                        Tabela Appointment: Essa tabela é responsável pelos registros de consultas médicas e é fundamental para o uso do FBM. Ela relaciona o profissional de saúde responsável pela consulta, o paciente que realizou a consulta e as atividades realizadas no período. Possui campos como profissional de saúde, paciente, consulta anterior, data, avaliação quantitativa de cada tipo de atividade realizada durante o período da consulta, média dessas avaliações e observações opcionais do profissional de saúde.",
            "isCollapsed": true,
            "link": "https://docs.google.com/document/d/1xlD7D3LS0gCsMdNG2ClHC7eDaEvv_a1pesHOUouaXPg/edit?usp=sharing"
        }
    ]
}